{
  "navigation": [
    {
      "keywords": ["where", "find", "navigate", "section", "service", "menu", "how to find", "where is", "location", "page"],
      "responses": [
        "To find a service in Absher, you can use the main menu at the top of the page. Services are organized by categories like Civil Affairs, Traffic, Labor, and more. You can also use the search bar to quickly find what you're looking for.",
        "In Absher, you can navigate to different services using the navigation menu. The main categories include: Civil Affairs (الأحوال المدنية), Traffic Services (المرور), Labor Services (العمل), and more. Click on any category to see available services.",
        "To navigate Absher, use the top navigation menu. You'll find services grouped by type. You can also use the search feature by typing keywords related to the service you need. What specific service are you looking for?",
        "Absher services are organized in the main menu. Look for categories like: Family Services, Traffic Services, Labor Services, and Business Services. Each category contains related services. Can you tell me which service you need?",
        "You can find services in Absher by browsing the main menu or using the search function. Services are categorized for easy access. What type of service are you trying to find?"
      ]
    },
    {
      "keywords": ["civil affairs", "أحوال مدنية", "family", "birth certificate", "marriage", "where is civil affairs", "find civil affairs"],
      "responses": [
        "Civil Affairs services (الأحوال المدنية) in Absher include: ID card services, passport services, family registry, birth certificates, marriage certificates, and more. You can find these under the 'Civil Affairs' section in the main menu.",
        "For Civil Affairs services, navigate to the 'Civil Affairs' (الأحوال المدنية) section in Absher. Here you can access services related to national ID, passports, family documents, and civil status certificates.",
        "Civil Affairs services are located in the main Absher menu under 'Civil Affairs' (الأحوال المدنية). This section includes all services related to personal documents and family affairs."
      ]
    },
    {
      "keywords": ["traffic", "مرور", "driving license", "vehicle", "car", "license", "driving"],
      "responses": [
        "Traffic services (المرور) in Absher include: driving license services, vehicle registration, traffic violations, license renewal, and vehicle ownership transfer. Find these under the 'Traffic Services' section.",
        "For traffic-related services, go to the 'Traffic Services' (المرور) section in Absher. Here you can manage your driving license, vehicle registration, check violations, and more.",
        "Traffic services are available in Absher under the 'Traffic Services' (المرور) menu. This includes all services related to vehicles and driving licenses."
      ]
    },
    {
      "keywords": ["labor", "عمل", "work permit", "employment", "job", "worker", "employee"],
      "responses": [
        "Labor services (العمل) in Absher include: work permit services, employment contracts, labor card services, and worker-related services. These are found under the 'Labor Services' section.",
        "For labor services, navigate to the 'Labor Services' (العمل) section in Absher. Here you can access work permits, employment documentation, and labor-related services.",
        "Labor services are located under the 'Labor Services' (العمل) menu in Absher. This section handles all work permit and employment-related services."
      ]
    }
  ],
  "services": [
    {
      "keywords": ["marriage with foreigner", "marriage foreigner", "marry foreigner", "foreign marriage", "marriage permission"],
      "responses": [
        "Marriage with Foreigner service allows Saudi citizens to apply for permission to marry a foreigner. The process involves submitting required documents including identification, proof of relationship, and other necessary paperwork through Absher. You'll need to log in to your Absher account, navigate to Civil Affairs services, select the Marriage with Foreigner service, fill out the application form, upload all required documents, and submit your request. The processing time for this service is 1 to 3 business days. You'll receive notifications about your application status via SMS and can track it in your Absher account.",
        "To apply for Marriage with Foreigner permission: Log in to Absher, go to Civil Affairs services, select Marriage with Foreigner, complete the application with your details and your partner's information, upload required documents like identification and proof of relationship, submit the application. Processing takes 1 to 3 business days. You'll be notified via SMS when your application is reviewed.",
        "Marriage with Foreigner service requires you to log in to Absher, access Civil Affairs section, choose the Marriage with Foreigner option, fill in all required information about yourself and your foreign partner, attach necessary documents, and submit. The application will be processed within 1 to 3 business days, and you'll receive updates via SMS."
      ]
    },
    {
      "keywords": ["travel in banned countries", "travel banned countries", "banned countries travel", "travel permission", "travel ban", "banned country"],
      "responses": [
        "Travel in Banned Countries service allows you to request permission to travel to countries that are typically restricted for Saudi citizens. To use this service, log in to your Absher account, go to the appropriate section (usually under Civil Affairs or Travel Services), select the Travel in Banned Countries service, complete the application form with your travel details and reason, upload required documents such as your passport and travel itinerary, and submit your request. The processing time for this service is 1 to 3 business days. You'll be notified of the decision via SMS and can check the status in your Absher account.",
        "To request travel permission to banned countries: Log in to Absher, navigate to Travel Services or Civil Affairs, select Travel in Banned Countries service, provide your travel destination, dates, and reason for travel, upload your passport copy and travel itinerary, submit the application. Processing takes 1 to 3 business days. You'll receive an SMS notification with the decision.",
        "Travel in Banned Countries service requires logging into Absher, finding the Travel Services section, selecting Travel in Banned Countries, entering your destination country and travel dates, explaining your reason for travel, uploading passport and itinerary documents, then submitting. The application is processed within 1 to 3 business days, and you'll get notified via SMS."
      ]
    },
    {
      "keywords": ["how", "explain", "what is", "what are", "how does", "how to", "steps", "process", "procedure", "guide"],
      "responses": [
        "I can explain how Absher services work! Each service has specific steps and requirements. Could you tell me which specific service you'd like me to explain? For example: Marriage with Foreigner, Travel in Banned Countries, etc.",
        "I'm here to provide clear explanations of Absher services. Each service follows a specific process with required documents and steps. What service would you like me to explain?",
        "I can walk you through how any Absher service works. Services typically require: logging in, selecting the service, providing required information, uploading documents if needed, and submitting. Which service are you interested in?"
      ]
    },
    {
      "keywords": ["id", "national id", "identity card", "renew", "renewal", "هوية"],
      "responses": [
        "To renew your National ID through Absher: 1) Log in to your Absher account, 2) Go to Civil Affairs services, 3) Select 'ID Services', 4) Choose 'Renew ID', 5) Follow the instructions and pay the fees. You'll need a recent photo and may need to visit a Civil Affairs office.",
        "National ID renewal in Absher: Log in → Civil Affairs → ID Services → Renew ID. You'll need to provide updated information, upload a recent photo, and pay the renewal fee. The process is usually completed within a few days.",
        "For ID renewal: Access Absher, navigate to Civil Affairs section, select ID renewal service, complete the form with required information, upload necessary documents, and submit. Processing time varies but is typically quick."
      ]
    },
    {
      "keywords": ["passport", "جواز سفر", "apply", "application"],
      "responses": [
        "To apply for a passport through Absher: 1) Log in to Absher, 2) Go to Civil Affairs services, 3) Select 'Passport Services', 4) Choose 'New Passport Application' or 'Passport Renewal', 5) Fill in the required information, 6) Upload necessary documents, 7) Pay fees, 8) Schedule an appointment if required.",
        "Passport application process: Log in to Absher → Civil Affairs → Passport Services → Select application type → Complete form → Upload documents (ID, photo) → Pay fees → Submit. You may need to visit a Civil Affairs office for biometrics.",
        "For passport services: Access Absher, go to Civil Affairs section, select Passport Services, choose your service type, provide required information and documents, pay the applicable fees, and follow the instructions for completion."
      ]
    },
    {
      "keywords": ["work permit", "تصريح عمل", "iqama", "إقامة"],
      "responses": [
        "To apply for a work permit through Absher: 1) Log in (employer or authorized person), 2) Go to Labor Services, 3) Select 'Work Permit Services', 4) Choose the type of permit needed, 5) Fill in worker and employer information, 6) Upload required documents, 7) Pay fees, 8) Submit application. Processing time varies.",
        "Work permit application: Log in to Absher → Labor Services → Work Permit → Select permit type → Enter worker details → Upload documents (contract, medical, etc.) → Pay fees → Submit. Status can be tracked in your Absher account.",
        "For work permits: Access Absher Labor Services section, select Work Permit application, provide worker and employment details, upload required documents (employment contract, medical certificate if needed), pay fees, and submit. Track status through Absher."
      ]
    },
    {
      "keywords": ["driving license", "رخصة قيادة", "license renewal", "traffic license"],
      "responses": [
        "To renew your driving license through Absher: 1) Log in, 2) Go to Traffic Services, 3) Select 'Driving License Services', 4) Choose 'License Renewal', 5) Check your license status and expiry, 6) Complete renewal form, 7) Pay renewal fees, 8) You may need to complete a medical examination. The renewed license will be available for pickup or delivery.",
        "Driving license renewal: Log in to Absher → Traffic Services → Driving License → Renew License → Complete form → Pay fees → Complete medical if required → Receive confirmation. Processing usually takes a few days.",
        "For license renewal: Access Absher Traffic Services, select Driving License renewal, verify your license information, complete the renewal application, pay applicable fees, and follow any additional requirements like medical examination."
      ]
    }
  ],
  "status": [
    {
      "keywords": ["status", "check", "track", "where is", "progress", "update", "application status", "request status", "my application", "my request"],
      "responses": [
        "To check your request status in Absher: 1) Log in to your Absher account, 2) Go to 'My Services' or 'My Requests' section, 3) Find your application/request, 4) Click on it to see detailed status. You can also receive SMS notifications about status updates. Please provide your Saudi National ID number and I can check the status for you.",
        "You can check the status of any Absher request by logging in and going to the 'My Services' section. All your submitted applications and requests are listed there with their current status. Status updates are also sent via SMS. Please provide your 10-digit Saudi National ID number and I can look up your application status.",
        "To track your application: Log in to Absher → My Services/My Requests → Find your application → View status. Statuses typically include: Submitted, Under Review, Approved, Rejected, or Completed. You'll receive notifications for updates. Share your ID number with me and I'll check the status immediately.",
        "Check your Absher request status by: Logging in → Navigating to 'My Services' → Finding your request in the list → Viewing details. The system shows real-time status and any required actions. SMS notifications are sent for important updates. You can also provide your ID number here and I'll check it for you."
      ]
    },
    {
      "keywords": ["when", "how long", "time", "duration", "processing time", "how much time"],
      "responses": [
        "Processing times in Absher vary by service type. Most services are processed within 1-3 business days, while some may take up to a week. Complex applications or those requiring additional verification may take longer. You can check the estimated time in the service details.",
        "Processing times depend on the service: Simple services (like status checks) are instant, standard services (ID renewal, license renewal) typically take 1-3 days, while complex services (new applications, work permits) may take 3-7 business days. Check your request status for updates.",
        "Absher processing times: Most services complete within 1-3 business days. Services requiring document verification or appointments may take longer. You'll receive SMS notifications when your request status changes. Check 'My Services' for current status."
      ]
    },
    {
      "keywords": ["approved", "rejected", "completed", "pending", "under review"],
      "responses": [
        "If your request shows 'Approved', it means it has been processed successfully. You may need to complete additional steps like payment, document pickup, or appointment scheduling. Check the request details for next steps.",
        "If status is 'Under Review', your application is being processed. This is normal and you'll be notified when the status changes. 'Pending' means waiting for required information or documents - check if any action is needed from you.",
        "Status meanings: 'Approved' = Successfully processed, 'Under Review' = Being processed, 'Pending' = Waiting for information/documents, 'Rejected' = Application declined (check reason), 'Completed' = Fully processed and ready. Check request details for specific information."
      ]
    }
  ]
}
